#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-4Y3RJuYykZLne9hD

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126962116]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.module.storybook.aws_s3_bucket.main: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate: Refreshing state... [id=prod/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=prod/elasticsearch-credentials]
module.infrastructure.module.monitoring.kubernetes_namespace.logging: Refreshing state... [id=logging]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.kubernetes_ingress.prod_ingress: Refreshing state... [id=prod/foreign-language-reader-ingress]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=prod/application-secret]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=content/spark-config]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]
module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1RVJJFB4SD5MG]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.storybook.digitalocean_record.subdomain: Refreshing state... [id=127348002]
module.infrastructure.module.storybook.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/storybook.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy: Refreshing state... [id=storybook.foreignlanguagereader.com-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.kubernetes_ingress.prod_ingress will be destroyed
  - resource "kubernetes_ingress" "prod_ingress" {
      - id                     = "prod/foreign-language-reader-ingress" -> null
      - load_balancer_ingress  = [] -> null
      - wait_for_load_balancer = false -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/ingress.class"             = "nginx"
              - "nginx.ingress.kubernetes.io/enable-cors" = "true"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "foreign-language-reader-ingress" -> null
          - namespace        = "prod" -> null
          - resource_version = "618760" -> null
          - self_link        = "/apis/extensions/v1beta1/namespaces/prod/ingresses/foreign-language-reader-ingress" -> null
          - uid              = "0cce4dd7-0ff5-4c1e-9437-079c5a062cb1" -> null
        }

      - spec {

          - rule {
              - host = "api.foreignlanguagereader.com" -> null

              - http {
                  - path {
                      - backend {
                          - service_name = "api" -> null
                          - service_port = "9000" -> null
                        }
                    }
                }
            }

          - tls {
              - hosts       = [
                  - "api.foreignlanguagereader.com",
                ] -> null
              - secret_name = "nginx-certificate" -> null
            }
        }
    }

  # module.infrastructure.kubernetes_namespace.prod will be destroyed
  - resource "kubernetes_namespace" "prod" {
      - id = "prod" -> null

      - metadata {
          - annotations      = {
              - "name" = "prod"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "prod" -> null
          - resource_version = "52741" -> null
          - self_link        = "/api/v1/namespaces/prod" -> null
          - uid              = "acbfb8c1-7ed5-48db-aea5-3fe9eb0bf62e" -> null
        }
    }

  # module.infrastructure.kubernetes_namespace.qa will be destroyed
  - resource "kubernetes_namespace" "qa" {
      - id = "qa" -> null

      - metadata {
          - annotations      = {
              - "name" = "qa"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "qa" -> null
          - resource_version = "52743" -> null
          - self_link        = "/api/v1/namespaces/qa" -> null
          - uid              = "58f58be7-b44b-49c3-9a74-63e2a7117583" -> null
        }
    }

  # module.infrastructure.module.api.kubernetes_deployment.api must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "prod/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 45 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ namespace        = "prod" -> "default" # forces replacement
          ~ resource_version = "2348560" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/prod/deployments/api" -> (known after apply)
          ~ uid              = "2961e421-e504-46bc-be68-caa81d8c52f2" -> (known after apply)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (8 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_LEARNERS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_SPANISH_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                          ~ name = "ELASTIC_APM_SECRET_TOKEN" -> "ELASTICSEARCH_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "secret-token" -> "password"
                                  ~ name     = "logs-apm-token" -> "elasticsearch-credentials"
                                  - optional = false -> null
                                }
                            }
                        }
                      ~ env {
                          ~ name = "ELASTICSEARCH_PASSWORD" -> "TRUSTSTORE_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "password" -> "truststore"
                                    name     = "elasticsearch-credentials"
                                  - optional = false -> null
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "TRUSTSTORE_PASSWORD" -> "GOOGLE_APPLICATION_CREDENTIALS"
                          + value = "/etc/flrcredentials/gcloud-creds.json"

                          - value_from {

                              - secret_key_ref {
                                  - key      = "truststore" -> null
                                  - name     = "elasticsearch-credentials" -> null
                                  - optional = false -> null
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "GOOGLE_APPLICATION_CREDENTIALS" -> "ENVIRONMENT"
                          ~ value = "/etc/flrcredentials/gcloud-creds.json" -> "default"
                        }
                      - env {
                          - name  = "ENVIRONMENT" -> null
                          - value = "prod" -> null
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ resources {
                          ~ limits {
                              + cpu    = (known after apply)
                                # (1 unchanged attribute hidden)
                            }

                          ~ requests {
                              + cpu    = (known after apply)
                                # (1 unchanged attribute hidden)
                            }
                        }

                      ~ volume_mount {
                            name              = "flrcredentials"
                            # (3 unchanged attributes hidden)
                        }
                    }


                  ~ volume {
                        name = "flrcredentials"

                      ~ secret {
                          - optional     = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                    # (1 unchanged block hidden)
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale must be replaced
-/+ resource "kubernetes_horizontal_pod_autoscaler" "api_autoscale" {
      ~ id = "prod/api" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ namespace        = "prod" -> "default" # forces replacement
          ~ resource_version = "74652" -> (known after apply)
          ~ self_link        = "/apis/autoscaling/v1/namespaces/prod/horizontalpodautoscalers/api" -> (known after apply)
          ~ uid              = "5bb8b738-65f3-4ef3-9b07-3fbd015ff145" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.api.kubernetes_secret.application-secret must be replaced
-/+ resource "kubernetes_secret" "application-secret" {
      ~ id   = "prod/application-secret" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "application-secret"
          ~ namespace        = "prod" -> "default" # forces replacement
          ~ resource_version = "242243" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/prod/secrets/application-secret" -> (known after apply)
          ~ uid              = "f130d5a6-9466-488d-a785-5fbb34902d5b" -> (known after apply)
        }
    }

  # module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials must be replaced
-/+ resource "kubernetes_secret" "elasticsearch_credentials" {
      ~ id   = "prod/elasticsearch-credentials" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "elasticsearch-credentials"
          ~ namespace        = "prod" -> "default" # forces replacement
          ~ resource_version = "631385" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/prod/secrets/elasticsearch-credentials" -> (known after apply)
          ~ uid              = "9fc58df2-e9aa-4b4f-88da-b3ba3b436800" -> (known after apply)
        }
    }

  # module.infrastructure.module.api.kubernetes_service.api must be replaced
-/+ resource "kubernetes_service" "api" {
      ~ id                    = "prod/api" -> (known after apply)
      ~ load_balancer_ingress = [] -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ namespace        = "prod" -> "default" # forces replacement
          ~ resource_version = "74576" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/prod/services/api" -> (known after apply)
          ~ uid              = "7eb16ff5-a5c7-4227-884b-386fe920285b" -> (known after apply)
        }

      ~ spec {
          ~ cluster_ip                  = "10.245.194.164" -> (known after apply)
          - external_ips                = [] -> null
          + external_traffic_policy     = (known after apply)
          ~ health_check_node_port      = 0 -> (known after apply)
          - load_balancer_source_ranges = [] -> null
            # (4 unchanged attributes hidden)

          ~ port {
              ~ node_port   = 0 -> (known after apply)
              ~ target_port = "9000" -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.infrastructure.module.content.helm_release.spark must be replaced
-/+ resource "helm_release" "spark" {
      ~ id                         = "spark" -> (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v1beta2-1.2.0-3.0.0"
              - chart       = "spark-operator"
              - name        = "spark"
              - namespace   = "content"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - webhook = {
                          - enable = true
                        }
                    }
                )
              - version     = "1.0.5"
            },
        ] -> (known after apply)
        name                       = "spark"
      ~ namespace                  = "content" -> "default" # forces replacement
        # (24 unchanged attributes hidden)
    }

  # module.infrastructure.module.content.kubernetes_namespace.content will be destroyed
  - resource "kubernetes_namespace" "content" {
      - id = "content" -> null

      - metadata {
          - annotations      = {
              - "name" = "content"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "content" -> null
          - resource_version = "52742" -> null
          - self_link        = "/api/v1/namespaces/content" -> null
          - uid              = "6d4781ba-2a44-4a9a-b055-c0e02d751696" -> null
        }
    }

  # module.infrastructure.module.content.kubernetes_secret.spark_config must be replaced
-/+ resource "kubernetes_secret" "spark_config" {
      ~ id   = "content/spark-config" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "spark-config"
          ~ namespace        = "content" -> "default" # forces replacement
          ~ resource_version = "1837595" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/content/secrets/spark-config" -> (known after apply)
          ~ uid              = "114c8fc5-c084-4373-9a87-dc78054abcf7" -> (known after apply)
        }
    }

  # module.infrastructure.module.elasticsearch.helm_release.elasticsearch will be created
  + resource "helm_release" "elasticsearch" {
      + atomic                     = false
      + chart                      = "eck-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "elastic-operator"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.elastic.co"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.0.5"
      + wait                       = true
    }

  # module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles will be created
  + resource "kubernetes_secret" "elasticsearch_roles" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "elasticsearch-roles"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch must be replaced
-/+ resource "helm_release" "fluentd_elasticsearch" {
      ~ id                         = "fluentd" -> (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "3.1.0"
              - chart       = "fluentd-elasticsearch"
              - name        = "fluentd"
              - namespace   = "logging"
              - revision    = 3
              - values      = jsonencode(
                    {
                      - elasticsearch = {
                          - auth      = {
                              - enabled  = true
                              - password = "(sensitive value)"
                              - user     = "fluentd"
                            }
                          - hosts     = [
                              - "logs-es-http.logging.svc.cluster.local",
                            ]
                          - scheme    = "https"
                          - sslVerify = false
                        }
                    }
                )
              - version     = "11.6.2"
            },
        ] -> (known after apply)
        name                       = "fluentd"
      ~ namespace                  = "logging" -> "default" # forces replacement
      ~ values                     = [
          - <<-EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  hosts: 
                    - logs-es-http.logging.svc.cluster.local
                  scheme: https
                  sslVerify: false
            EOT,
          + <<-EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  hosts: 
                    - elastic-es-http.default.svc.cluster.local
                  scheme: https
                  sslVerify: false
            EOT,
        ]
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.monitoring.kubernetes_namespace.logging will be destroyed
  - resource "kubernetes_namespace" "logging" {
      - id = "logging" -> null

      - metadata {
          - annotations      = {
              - "name" = "logging"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "logging" -> null
          - resource_version = "397485" -> null
          - self_link        = "/api/v1/namespaces/logging" -> null
          - uid              = "42940f5b-acb8-4518-91f6-bc1b0af91917" -> null
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-nginx-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["elastic"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "elastic"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kibana"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.nginx.com/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.7.1"
      + wait                       = true

      + set {
          + name  = "extraArgs"
          + value = "--enable-ssl-passthrough"
        }
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress will be created
  + resource "kubernetes_ingress" "ingress" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "9000"
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "api.foreignlanguagereader.com",
                ]
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress_passthrough will be created
  + resource "kubernetes_ingress" "ingress_passthrough" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"                 = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors"     = "true"
              + "nginx.ingress.kubernetes.io/ssl-passthrough" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "elastic.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "elastic-es-http"
                          + service_port = "9200"
                        }
                    }
                }
            }
          + rule {
              + host = "elastic.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "kibana-kb-http"
                          + service_port = "5601"
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "api.foreignlanguagereader.com" -> null
      - id       = "126962116" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "157.230.196.161" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress will be destroyed
  - resource "helm_release" "nginx_ingress" {
      - atomic                     = false -> null
      - chart                      = "nginx-ingress" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "nginx-ingress" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.9.1"
              - chart       = "nginx-ingress"
              - name        = "nginx-ingress"
              - namespace   = "prod"
              - revision    = 1
              - values      = "null"
              - version     = "0.7.1"
            },
        ] -> null
      - name                       = "nginx-ingress" -> null
      - namespace                  = "prod" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://helm.nginx.com/stable" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.7.1" -> null
      - wait                       = true -> null
    }

  # module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate will be destroyed
  - resource "kubernetes_secret" "nginx_certificate" {
      - data = (sensitive value)
      - id   = "prod/nginx-certificate" -> null
      - type = "kubernetes.io/tls" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "nginx-certificate" -> null
          - namespace        = "prod" -> null
          - resource_version = "220422" -> null
          - self_link        = "/api/v1/namespaces/prod/secrets/nginx-certificate" -> null
          - uid              = "e66d677c-3f02-451b-a5ac-916a9189062b" -> null
        }
    }

Plan: 17 to add, 0 to change, 16 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
